[
    {
        "titulo": "BBVA revising synergy estimates, still sees value in proposed Sabadell deal",
        "categoria": "category",
        "fecha": "2025-08-07T16:52:18Z",
        "link": "https://www.reuters.com/business/finance/bbva-revising-synergy-estimates-still-sees-value-proposed-sabadell-deal-2025-08-07/",
        "contenido_completo": "MADRID, Aug 7 (Reuters) - Spain's BBVA\n(BBVA.MC)\n, opens new tab\nsaid on Thursday it was revising expected cost and funding synergies from its takeover bid for Sabadell\n(SABE.MC)\n, opens new tab\n, citing higher risks after the government\nimposed conditions\nand Sabadell\ngreenlit an important divestment\n.\nHowever, BBVA said it still believed the takeover would \"create value for the shareholders of both entities\".\nThe Reuters Tariff Watch newsletter is your daily guide to the latest global trade and tariff news. Sign up\nhere.\nIts update, filed with stock market regulator CNMV, came a day after Sabadell shareholders approved the sale of its British unit TSB to Santander , along with a 2.5 billion euro ($2.9 billion) one-off cash payout derived from the deal.\nAd Break Coming Up\nNEXT\nStay\nNext\nOff\nEnglish\n180p\n288p\n360p\n480p\n540p\n576p\n720p\nHD\n1080p\nHD\nAuto (180p)\nAbout Connatix\nV602549\nAbout Connatix\nV602549\n1/1\nSkip\nAd\nContinue watching\nafter the ad\nVisit Advertiser website\nGO TO PAGE\nBBVA warned that the government's requirement to keep the two lenders operationally independent for at least three years - extendable to five - would delay some of the benefits of the planned merger.\nPreviously BBVA signalled that if it kept Sabadell separate it would still be able to generate most of the expected 850 million euros in cost synergies over two years after completing the deal. But Thursday's filing did not include this figure, which it said is being reassessed.\nDiscover the key points from this story with Reuters AI\nTry Reuters AI\nTry Reuters AI\nAdvertisement · Scroll to continue\nThe lender added it only had access to public information on Sabadell when making its estimates, which could lead to unforeseen liabilities or integration challenges if the deal were to proceed.\nSome potential difficulties included the integration of staff, systems and operations, as well as risks of litigation and client attrition.\nIn addition, BBVA said delays or failure to complete the merger could hurt its share price, reputation and relationships with key stakeholders.\nAdvertisement · Scroll to continue\n($1 = 0.8593 euros)\nReporting by David Latona; Editing by Andrei Khalip and David Holmes\nOur Standards:\nThe Thomson Reuters Trust Principles.\n, opens new tab\nSuggested Topics:\nDeals\nShare\nX\nFacebook\nLinkedin\nEmail\nLink\nPurchase Licensing Rights"
    },
    {
        "titulo": "Spain's Cox prepares multibillion investment plan focused on Mexico",
        "categoria": "category",
        "fecha": "2025-08-07T12:32:31Z",
        "link": "https://www.reuters.com/business/energy/spains-cox-prepares-multibillion-investment-plan-focused-mexico-2025-08-07/",
        "contenido_completo": "Summary\nCompanies\nCox plans more than $10 billion in investment in Mexico by 2030\nFigure includes $4.2 billion acquisition of Iberdrola's assets\nCox will develop new renewable capacity, desalination projects\nKey Points\nMADRID, Aug 7 (Reuters) - Spanish energy company Cox\n(COXGA.MC)\n, opens new tab\nwill focus its new strategic plan on Mexico, where it envisages more than $10 billion in water and renewable energy investments by 2030, CEO Nacho Moreno told Reuters.\nThis figure includes the company's $4.2 billion\nacquisition\nof Iberdrola's\n(IBE.MC)\n, opens new tab\nassets in the country, a \"transformational\" deal that allowed Cox to already reach targets it had set for 2028, Moreno said.\nThe Reuters Power Up newsletter provides everything you need to know about the global energy industry. Sign up\nhere.\nAd Break Coming Up\nNEXT\nDanish wind farm developer Orsted said on Monday it plans a $9.4 billion rights issue citing adverse development in the U.S. offshore wind market.\nStay\nNext\n00:02\n00:59\nOff\nEnglish\n180p\n288p\n360p\n480p\n540p\n576p\n720p\nHD\n1080p\nHD\nAuto (180p)\nAbout Connatix\nV602549\nAbout Connatix\nV602549\n1/1\nSkip\nAd\nContinue watching\nafter the ad\nVisit Advertiser website\nGO TO PAGE\nThe new plan is expected to be presented on September 25.\nThe Iberdrola deal included 15 power plants with 2.6 gigawatts of capacity and an 11.8-GW pipeline of renewable projects.\nCox will develop at least two or three gigawatts from this pipeline, Moreno said, and has already identified six desalination projects it will prioritise, which require an investment of around $1.5 billion.\n\"The power demand and the water demand are only growing\" in Mexico, he said. \"Through this acquisition, we are extremely well-placed to capture both.\"\nDiscover the key points from this story with Reuters AI\nTry Reuters AI\nTry Reuters AI\nAdvertisement · Scroll to continue\nReport This Ad\nMoreno expects synergies between Cox's water and energy operations and its unit offering services like engineering and operating and management of facilities and infrastructure. The services unit, for example, will handle engineering for the new capacity it will develop, he said.\nCox expects the acquisition will more than double revenue estimates for this year to around 2.7 billion euros ($3.15 billion) and more than triple expected earnings before interest, taxes, depreciation and amortisation to 720 million euros.\nAdvertisement · Scroll to continue\nOperating cash flow should rise to around 450 million euros from around 100 million euros expected previously.\n\"When you generate $500 million of cash flow, clearly you're jumping to another league,\" Moreno said.\nThe acquisition, 75% of which will be funded with debt and the rest with equity, will be carried out through a new company owned by Cox.\nCox will inject capital for the equity, along with two international investors which will get preferred securities, Moreno said, declining to name the investors.\nAdvertisement · Scroll to continue\nFor the debt, Cox has secured support from Citigroup\n(C.N)\n, opens new tab\n, Bank of America\n(BAC.N)\n, opens new tab\n, Santander\n(SAN.MC)\n, opens new tab\n, Barclays\n(BARC.L)\n, opens new tab\nand BBVA\n(BBVA.MC)\n, opens new tab\n, he said.\n($1 = 0.8573 euros)\nReporting by Pietro Lombardi.\nEditing by Mark Potter\nOur Standards:\nThe Thomson Reuters Trust Principles.\n, opens new tab\nSuggested Topics:\nEnergy\nGrid & Infrastructure\nSolar\nWind\nClean Energy\nShare\nX\nFacebook\nLinkedin\nEmail\nLink\nPurchase Licensing Rights"
    },
    {
        "titulo": "Sabadell shareholders approve TSB sale, $2.9 billion special dividend",
        "categoria": "category",
        "fecha": "2025-08-06T13:21:55Z",
        "link": "https://www.reuters.com/sustainability/sustainable-finance-reporting/sabadell-shareholders-approve-tsb-sale-29-billion-special-dividend-2025-08-06/",
        "contenido_completo": "Summary\nCompanies\nTSB sale a defensive move against BBVA takeover\nShareholders unanimously back $2.9 bln cash dividend\nBBVA must decide to proceed or withdraw bid\nKey Points\nMADRID, Aug 6 (Reuters) - Sabadell\n(SABE.MC)\n, opens new tab\nshareholders on Wednesday unanimously approved the sale of its TSB business in Britain to Santander\n(SAN.MC)\n, opens new tab\n, which analysts see as a defensive move against BBVA's\n(BBVA.MC)\n, opens new tab\nhostile takeover bid.\nThe shareholders also backed a one-off cash dividend worth 2.5 billion euros ($2.90 billion) from the TSB sale.\nThe Reuters Daily Briefing newsletter provides all the news you need to start your day. Sign up\nhere.\nSabadell agreed last month to\nsell\nTSB to Santander for an initial 2.65 billion pounds ($3.53 billion) in cash, which analysts viewed as a strategy to stop BBVA's takeover approach, which aims to create Spain's second-biggest bank by credit volume after Caixabank\n(CABK.MC)\n, opens new tab\n.\nAd Break Coming Up\nNEXT\nStay\nNext\nOff\nEnglish\n180p\n288p\n360p\n480p\n540p\n576p\n720p\nHD\n1080p\nHD\nAuto (180p)\nAbout Connatix\nV602487\nAbout Connatix\nV602487\n1/1\nSkip\nAd\nContinue watching\nafter the ad\nVisit Advertiser website\nGO TO PAGE\nBBVA did not immediately reply to a Reuters request for comment following the Sabadell votes.\nBBVA can now decide whether to withdraw its 15-billion-euro offer or carry on with it, which would require approval of its bid prospectus by the market regulator - expected at the beginning of September, when the\nacceptance period\nfor the bid is expected to start.\nBBVA would then follow with a formal offer and Sabadell shareholders would have 30 to 70 days to tender their shares.\nDiscover the key points from this story with Reuters AI\nTry Reuters AI\nTry Reuters AI\nAdvertisement · Scroll to continue\nSabadell Chairman Josep Oliu told shareholders on Wednesday the TSB sale allowed Sabadell to focus on the Spanish market, \"where the bank has a greater growth capacity\".\nPeople walk past a branch of Spain's Sabadell bank in Bilbao, Spain, February 3, 2025. REUTERS/Vincent West/File Photo\nPurchase Licensing\nRights\n, opens new tab\nSabadell had bought TSB in 2015 for 1.7 billion pounds.\nIn Spain, the law requires governing bodies of a company targeted in a takeover bid to seek shareholder approval before promoting or taking any action that might prevent an acquisition from succeeding.\nAdvertisement · Scroll to continue\nBBVA's bid, launched in April last year, originally valued Sabadell at 12 billion euros, but that value has increased to about 15 billion euros as the banks' share prices have diverged since the offer was first made.\nSabadell's management opposed the deal from the beginning, but Spain's anti-trust regulator approved it with some minor remedies. The Spanish government imposed as a condition that the two banks had to remain separate for at least three years.\nAdvertisement · Scroll to continue\nOliu said the government's condition would prevent synergies from being generated and told shareholders to consider risks arising from the integration process when deciding whether to accept BBVA's bid.\nSabadell CEO Cesar Gonzalez-Bueno, responding to questions from shareholders, said BBVA's future prospectus on its bid needed to be transparent and to make clear whether Sabadell shareholders will receive 25% of the bank's stock market value over the next 12 months or 40% over three years.\n($1 = 0.8616 euros)\n($1 = 0.7513 pounds)\nReporting by Jesus Aguado and Inti Landauro; Editing by David Latona and Jane Merriman\nOur Standards:\nThe Thomson Reuters Trust Principles.\n, opens new tab\nSuggested Topics:\nFinance\nShareholder Activism\nShare\nX\nFacebook\nLinkedin\nEmail\nLink\nPurchase Licensing Rights"
    },
    {
        "titulo": "European shares rebound after Friday's selloff, Swiss stocks fall",
        "categoria": "category",
        "fecha": "2025-08-04T16:47:32Z",
        "link": "https://www.reuters.com/markets/europe/european-shares-rebound-after-fridays-selloff-swiss-stocks-fall-2025-08-04/",
        "contenido_completo": "Summary\nCompanies\nSMI drops as trading resumes after long weekend\nUK banks gain after ruling on motor finance commissions\nKey Points\nAug 4 (Reuters) - European shares closed higher on Monday, rebounding from six-week lows as a surge in banking stocks offset a decline in Swiss shares following a hefty 39% U.S. tariff on Swiss goods.\nThe pan-European STOXX 600 index\n(.STOXX)\n, opens new tab\nrose 0.9%, with most major regional markets, barring Swiss stocks, rebounding from Friday's sharp losses, when worries about tariffs and a weak U.S. jobs report hammered sentiment.\nGet a look at the day ahead in European and global markets with the Morning Bid Europe newsletter. Sign up\nhere.\nAdvertisement · Scroll to continue\nThe German DAX\n(.GDAXI)\n, opens new tab\nclimbed 1.4%, France's CAC 40\n(.FCHI)\n, opens new tab\nrose 1.1% and Britain's FTSE 100\n(.FTSE)\n, opens new tab\nadded 0.7%.\nZurich's SMI index\n(.SSMI)\n, opens new tab\ndipped 0.2% as trading resumed following a long weekend. Switzerland was left stunned on Friday after Trump hit it with one of the highest tariffs in his global trade reset, with industry associations warning that tens of thousands of jobs were at risk.\nSwiss\nluxury watchmakers\n' shares, including Richemont\n(CFR.S)\n, opens new tab\nand Swatch\n(UHR.S)\n, opens new tab\n, fell 1.3% and 2.3%, respectively.\nAdvertisement · Scroll to continue\nDiscover the key points from this story with Reuters AI\nTry Reuters AI\nTry Reuters AI\n\"It's understandable why Switzerland is lagging. Companies most exposed to international trade flows appear to be under the greatest pressure. However, a quarter percent decline isn't particularly significant,\" said Russ Mould, investment director at AJ Bell.\nThe German share price index DAX graph is pictured at the stock exchange in Frankfurt, Germany, August 1, 2025.   REUTERS/Wolfgfang Rattay/ File Photo\nPurchase Licensing\nRights\n, opens new tab\n\"It seems there may still be hopes that a deal will be struck on terms that are, if not favourable, at least less unfavourable than what the White House has imposed so far.\"\nAdvertisement · Scroll to continue\nSwitzerland was ready to make a \"more attractive offer\" in trade talks with Washington, its government\nsaid\non Monday.\nThe duties were scheduled to go into effect on Thursday, giving Switzerland, which counts the U.S. as its top export market for pharmaceuticals, watches, machinery and chocolates, a small window to strike a better deal.\nEuropean stocks have moved further away from this year's peak as U.S. tariffs on its key trading partners raise concerns about a resurgence in inflationary pressures and slowing economic growth.\nBanks\n(.SX7P)\n, opens new tab\nwere a bright spot on the day, with shares in\nBritish lenders\nsurging after the country's Supreme Court\noverturned a ruling\non motor finance commissions, easing fears among banks about a redress scheme some analysts had warned could run into the tens of billions of pounds.\nLloyds\n(LLOY.L)\n, opens new tab\nadded 9% to the top of the STOXX 600, while Close Brothers\n(CBRO.L)\n, opens new tab\nsurged 24%. Barclays\n(BARC.L)\n, opens new tab\n, Bank of Ireland and Santander\n(SAN.MC)\n, opens new tab\nall gained more than 2% each.\nUBS\n(UBSG.S)\n, opens new tab\ndipped 0.7%\nafter\nthe bank said it would pay $300 million to resolve U.S. mortgage securities cases related to the misselling of mortage-linked investments.\nReporting by Twesha Dikshit, Medha Singh and Ragini Mathur in Bengaluru; Editing by Subhranshu Sahu, Shinjini Ganguli and Alex Richardson\nOur Standards:\nThe Thomson Reuters Trust Principles.\n, opens new tab\nSuggested Topics:\nStocks\nShare\nX\nFacebook\nLinkedin\nEmail\nLink\nPurchase Licensing Rights"
    },
    {
        "titulo": "British bank shares jump after Supreme Court ruling on car loan claims",
        "categoria": "category",
        "fecha": "2025-08-04T13:49:26Z",
        "link": "https://www.reuters.com/business/finance/british-bank-shares-jump-after-supreme-court-ruling-car-loan-claims-2025-08-04/",
        "contenido_completo": "Summary\nCompanies\nSupreme Court ruling favors banks in motor finance claims\nPotential compensation costs could be 9-18 billion pounds\nLloyds, Close Brothers, Barclays likely to face fewer claims\nBanks could have to set aside more cash for provisions\nKey Points\nLONDON, Aug 4 (Reuters) - Shares in British lenders surged on Monday after a\nSupreme Court ruling\non motor finance claims last week went largely in their favour, although it still left banks facing billions of pounds of potential compensation claims collectively.\nLloyds Banking Group\n(LLOY.L)\n, opens new tab\nshares jumped 7%, on track for its biggest daily gain in three years, while specialist Close Brothers'\n(CBRO.L)\n, opens new tab\nstock was up 21%.\nThe Reuters Tariff Watch newsletter is your daily guide to the latest global trade and tariff news. Sign up\nhere.\nBarclays\n(BARC.L)\n, opens new tab\n, a smaller player in the market, gained 2.3%, while Bank of Ireland\n(BIRG.I)\n, opens new tab\nand Santander\n(SAN.MC)\n, opens new tab\n- both exposed through their UK arms, gained 3% and 2.3% respectively.\nAd Break Coming Up\nNEXT\nStay\nNext\nOff\nEnglish\n180p\n288p\n360p\n480p\n540p\n576p\n720p\nHD\n1080p\nHD\nAuto (180p)\nAbout Connatix\nV602549\nAbout Connatix\nV602549\n1/1\nSkip\nAd\nContinue watching\nafter the ad\nVisit Advertiser website\nGO TO PAGE\nBritain's Financial Conduct Authority (FCA)\nsaid on Sunday\nit would consult on a redress scheme for motorists claiming to have been overcharged, estimating the total bill could hit between 9 billion and 18 billion pounds ($12-24 billion).\nHowever, that cost is likely to be substantially lower than analysts' early estimates of more than 30 billion pounds, after the Supreme Court on Friday overturned an earlier Court of Appeal judgment that had\nwidened\nthe scope of valid claims.\nDiscover the key points from this story with Reuters AI\nTry Reuters AI\nTry Reuters AI\nAdvertisement · Scroll to continue\nBanking analysts at RBC said they expected the cost to come in at 11.5 billion pounds, leaving several banks under-provisioned and potentially needing to set aside more cash, but less than the market had expected.\nLloyds said on Monday it would keep under review its 1.2 billion pound ($1.6 billion) provision for motor finance claims, and that any change was \"unlikely to be material.\"\nClose Brothers, which had previously set aside 165 million pounds, made no mention of its provision on Monday but said it would engage with the FCA on its consultation.\nAdvertisement · Scroll to continue\nSouth African bank FirstRand\n(FSRJ.J)\n, opens new tab\n, which mounted the Supreme Court appeal alongside Close Brothers, said it may need to update its own provision following the judgment.\n\"(The judgment) has taken the worst case scenario off the table,\" said Gary Greenwood, analyst at Shore Capital.\nHe said lenders would likely still face some claims if consumers could prove they had been treated unfairly.\nLloyds, Close Brothers, Barclays, Santander and Bank of Ireland had previously set aside nearly 2 billion pounds between them.\nAdvertisement · Scroll to continue\n\"We expect this move to accelerate M&A activity due to some lenders having decreased risk appetite but also because of (some) unused provision amounts,\" said Hyder Jumabhoy, partner at law firm White & Case.\nThe FCA said on Sunday it would launch a consultation on its redress scheme by early October. Car loans dating back to 2007 would\npossibly qualify\nfor redress.\n($1 = 0.7534 pounds)\nReporting by Iain Withers, Additional reporting by Charlie Conchie and Danilo Masoni; Editing by Kirsten Donovan and Bernadette Baum\nOur Standards:\nThe Thomson Reuters Trust Principles.\n, opens new tab\nSuggested Topics:\nFinance\nFinance & Banking\nShare\nX\nFacebook\nLinkedin\nEmail\nLink\nPurchase Licensing Rights"
    },
    {
        "titulo": "UK's FCA proposes redress plan for motor-finance claims",
        "categoria": "category",
        "fecha": "2025-08-04T13:13:02Z",
        "link": "https://www.reuters.com/business/finance/uks-fca-proposes-9-billion-18-billion-pound-redress-scheme-motor-finance-claims-2025-08-03/",
        "contenido_completo": "Summary\nCompanies\nFCA decision comes after Supreme Court ruling on Friday\nIndustry-wide scheme to look at certain types of claims\nConsultation due to start October, payments to follow in 2026\nLenders had expected to face claims despite court ruling\nKey Points\nLONDON, Aug 3 (Reuters) - Britain's Financial Conduct Authority (FCA) on Sunday proposed a redress scheme for consumers with motor finance compensation claims following last week's\nSupreme Court ruling\n, estimating the cost at between 9 billion and 18 billion pounds ($12 billion and $24 billion).\nFriday's court decision had calmed the industry's worst fears about the size of the bill it would face over improperly disclosed commissions on car loans - a sum analysts had estimated could run to tens of billions of pounds.\nThe Reuters Tariff Watch newsletter is your daily guide to the latest global trade and tariff news. Sign up\nhere.\nAd Break Coming Up\nNEXT\nStay\nNext\nOff\nEnglish\n180p\n288p\n360p\n480p\n540p\n576p\n720p\nHD\n1080p\nHD\nAuto (180p)\nAbout Connatix\nV602549\nAbout Connatix\nV602549\n1/1\nSkip\nAd\nContinue watching\nafter the ad\nVisit Advertiser website\nGO TO PAGE\nHowever, after considering that ruling, which was largely seen as a win for the banks, the FCA still proposed an industry-wide redress scheme for certain types of compensation claims.\n\"At this stage, we think it is unlikely that the cost of any scheme, including administrative costs, would be materially lower than 9 billion pounds and it could be materially higher,\" the FCA said in a statement.\nIt said the total cost was hard to estimate. It cautioned that any estimates were indicative and susceptible to change, but it said those in the middle of the 9 billion to 18 billion pounds range were \"more plausible.\"\nDiscover the key points from this story with Reuters AI\nTry Reuters AI\nTry Reuters AI\nAdvertisement · Scroll to continue\nSome level of further compensation payout had still been expected by banks after Friday's ruling, placing investor focus on the FCA's decision over whether to launch a full redress scheme, what it might look like, and how much it would cost.\nLenders, including Lloyds Banking Group\n(LLOY.L)\n, opens new tab\n, Close Brothers\n(CBRO.L)\n, opens new tab\n, Barclays\n(BARC.L)\n, opens new tab\nand the UK arms of Santander\n(SAN.MC)\n, opens new tab\nand Bank of Ireland\n(BIRG.I)\n, opens new tab\n, have already set aside nearly 2 billion pounds between them to cover potential motor finance compensation claims.\nAdvertisement · Scroll to continue\nThe FCA said firms should now refresh estimates of their liabilities, increase provisions where necessary, and keep markets informed.\nCONSUMER FAIRNESS\nPrior to the Supreme Court ruling, which overturned a previous court decision, there were fears the cost of redress could rival that of a payment protection insurance mis-selling scandal, which cost lenders over 40 billion pounds between 2011 and 2019.\nThe proposed motor finance scheme would cover so-called discretionary commission arrangements - those where the broker could adjust the interest rate offered to a customer - if they had not been properly disclosed.\nAdvertisement · Scroll to continue\nThe consultation will also look at which non-discretionary commission arrangements should be included.\nThe regulator said agreements dating back to 2007 should be considered and it would publish a consultation by early October, with an expectation that people start receiving compensation in 2026.\n\"Our consultation will cover how firms should assess whether the relationship between the lender and borrower was unfair for the purposes of our scheme,\" the statement said.\n\"Any redress scheme must be fair to consumers who have lost out and ensure the integrity of the motor finance market, so it works well for future consumers.\"\nThe consultation will also look at how interest is calculated on compensation, saying it estimated a simple annual rate of around 3% would be applicable.\nThe regulator said it had not decided whether the scheme should require customers to opt in, or be automatically involved unless they opt out.\n($1 = 0.7531 pounds)\nReporting by William James; Editing by Toby Chopra and Joe Bavier\nOur Standards:\nThe Thomson Reuters Trust Principles.\n, opens new tab\nSuggested Topics:\nRates & Bonds\nJudiciary\nFinance & Banking\nShare\nX\nFacebook\nLinkedin\nEmail\nLink\nPurchase Licensing Rights\nWilliam James\nThomson Reuters\nWilliam leads the UK Breaking News team, making sure Reuters is first to report key developments in political, economic and general news. He previously spent nearly a decade in Westminster as UK Political Correspondent and before that covered financial markets during the euro zone debt crisis.\nEmail\nX\nInstagram\nLinkedin"
    },
    {
        "titulo": "Startup firm Pulse Clean Energy gets 220 mln pounds to build battery storage across UK",
        "categoria": "category",
        "fecha": "2025-08-04T08:06:48Z",
        "link": "https://www.reuters.com/sustainability/climate-energy/startup-firm-pulse-clean-energy-gets-220-mln-pounds-build-battery-storage-across-2025-08-04/",
        "contenido_completo": "Companies\nPulse Clean Energy Uk Limited\nFollow\nABN Amro Bank NV\nFollow\nBanco Santander SA\nFollow\nShow more companies\nKey Points\nAug 4 (Reuters) - British startup Pulse Clean Energy said it had secured 220 million pounds ($292.3 million) in financing from six international banks to fund the development of six new battery storage system sites across the UK.\nIn a statement on Monday it did not say where the sites are but said they were \"strategically located across the UK in areas including Scotland, Devon, Greater Manchester, and Wales\". It said the financing deal was signed with Santander\n(SAN.MC)\n, opens new tab\n, NatWest\n(NWG.L)\n, opens new tab\n, ABN AMRO\n(ABNd.AS)\n, opens new tab\n, Nord/LB, Investec and CIBC.\nMake sense of the latest ESG trends affecting companies and governments with the Reuters Sustainable Switch newsletter. Sign up\nhere.\nAd Break Coming Up\nNEXT\nStay\nNext\nOff\nEnglish\n180p\n288p\n360p\n480p\n540p\n576p\n720p\nHD\n1080p\nHD\nAuto (180p)\nAbout Connatix\nV602549\nAbout Connatix\nV602549\n1/1\nSkip\nAd\nContinue watching\nafter the ad\nVisit Advertiser website\nGO TO PAGE\nWHY IT'S IMPORTANT:\nThe planned development of these new battery storage sites comes as Britain pushes on with plans to decarbonise its electricity sector by 2030 and develop more renewable energy.\nBritain is aiming to, at the very least, double its current investment levels across the\nclean energy industries\nto more than 30 billion pounds per year by 2035.\nKEY QUOTES:\n\"This landmark investment reflects strong global confidence in the growing UK battery storage market and in Pulse Clean Energy's ability to deliver at scale,\" the company's Chief Financial Officer Nicola Johnson said.\nDiscover the key points from this story with Reuters AI\nTry Reuters AI\nTry Reuters AI\nAdvertisement · Scroll to continue\nReport This Ad\n\"These six facilities will not only strengthen grid resilience, but also unlock significant cost savings for consumers by allowing more renewable power onto the grid and reducing the need for expensive backup power during peak periods.\"\nBY THE NUMBERS:\nThe six new battery energy storage system sites will collectively provide more than 700MWh of capacity, and should create more than 200 million pounds worth of gas and emissions savings for UK consumers, Pulse Energy said.\nAdvertisement · Scroll to continue\nPulse Energy, founded in 2022, aims to have more than 2GWh of operational capacity by 2030.\n($1 = 0.7526 pounds)\nReporting by Sudip Kar-Gupta; Editing by David Holmes\nOur Standards:\nThe Thomson Reuters Trust Principles.\n, opens new tab\nSuggested Topics:\nClimate & Energy\nGrid & Infrastructure\nClean Energy\nShare\nX\nFacebook\nLinkedin\nEmail\nLink\nPurchase Licensing Rights"
    },
    {
        "titulo": "Potential UK car finance compensation scheme would be smaller than PPI, says regulator",
        "categoria": "category",
        "fecha": "2025-08-03T12:14:08Z",
        "link": "https://www.reuters.com/sustainability/boards-policy-regulation/potential-uk-car-finance-compensation-scheme-would-be-smaller-than-ppi-says-2025-08-03/",
        "contenido_completo": "Companies\nBanco Santander SA\nFollow\nBank of Ireland Group PLC\nFollow\nBarclays PLC\nFollow\nShow more companies\nKey Points\nLONDON, Aug 3 (Reuters) - Any future motor finance compensation scheme for consumers in Britain would be substantially smaller than the payment protection insurance (PPI) redress scheme that cost banks tens of billions of pounds, the UK's top financial regulator said.\nThe Supreme Court\noverturned a landmark ruling\non car finance commissions on Friday, easing fears among banks about the cost of an industry-wide redress scheme, though lenders will still likely face claims for overcharging in some cases.\nMake sense of the latest ESG trends affecting companies and governments with the Reuters Sustainable Switch newsletter. Sign up\nhere.\nAd Break Coming Up\nNEXT\nStay\nNext\nOff\nEnglish\n180p\n288p\n360p\n480p\n540p\n576p\n720p\nHD\n1080p\nHD\nAuto (180p)\nAbout Connatix\nV602549\nAbout Connatix\nV602549\n1/1\nSkip\nAd\nContinue watching\nafter the ad\nVisit Advertiser website\nGO TO PAGE\nIn response to Friday's ruling, the Financial Conduct Authority (FCA) said it would confirm before markets open on Monday whether it planned to consult on a new redress scheme.\n\"We would expect any outcome, if we are to move forward with an industry-wide compensation scheme, to be substantially less than the PPI episode,\" FCA chief executive Nikhil Rathi told the Sunday Times newspaper before any decision had been made public.\nDiscover the key points from this story with Reuters AI\nTry Reuters AI\nTry Reuters AI\nAdvertisement · Scroll to continue\nHe did not comment on a specific number, according to the report.\nMis-selling of payment protection insurance cost lenders over 40 billion pounds ($53 billion) to redress between 2011 and 2019.\nLenders, including Lloyds Banking Group\n(LLOY.L)\n, opens new tab\n, Close Brothers\n(CBRO.L)\n, opens new tab\n, Barclays\n(BARC.L)\n, opens new tab\nand the UK arms of Santander\n(SAN.MC)\n, opens new tab\nand Bank of Ireland\n(BIRG.I)\n, opens new tab\n, have already set aside nearly 2 billion pounds between them to cover potential motor finance compensation claims.\nAdvertisement · Scroll to continue\n($1 = 0.7531 pounds)\nReporting by William James; Editing by Joe Bavier\nOur Standards:\nThe Thomson Reuters Trust Principles.\n, opens new tab\nSuggested Topics:\nBoards, Policy & Regulation\nJudiciary\nCompensation\nShare\nX\nFacebook\nLinkedin\nEmail\nLink\nPurchase Licensing Rights"
    }
]